In [3]:
# import packages
import numpy as np
import pandas as pd

import re
from datetime import datetime

In [4]:
# read in data
df = pd.read_csv('./combined.csv')

In [5]:
#get info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23735 entries, 0 to 23734
Data columns (total 30 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            23735 non-null  int64
 1   ACCIDENTDATE          23735 non-null  object
 2   AOTACTUALMILEPOINT    23735 non-null  float64
 3   AOTROUTE              23735 non-null  object
 4   Animal                23735 non-null  object
 5   CITYORTOWN            23735 non-null  object
 6   DIROFCOLLI            23735 non-null  object
 7   DayNight              23735 non-null  object
 8   HOWMAPPED             23735 non-null  object
 9   INTERSECTIONWITH      23735 non-null  object
 10  Impairment            23735 non-null  object
 11  InjuryType            23735 non-null  object
 12  Involving             23735 non-null  object
 13  LAT_DD                23735 non-null  float64
 14  LOCALID               23735 non-null  object
 15  LOC_ERROR             23735 non-null  object
 16  LONG_DD               23735 non-null  float64
 17  LRSNUMBER             23735 non-null  object
 18  NonReportableAddress  23735 non-null  object
 19  REPORTINGAGENCY       23735 non-null  object
 20  REPORTNUMBER          23735 non-null  object
 21  RoadCharacteristics   23735 non-null  object
 22  RoadCondition         23735 non-null  object
 23  RoadGroup             23735 non-null  object
 24  STREETADDRESS         23735 non-null  object
 25  SurfaceCondition      23735 non-null  object
 26  Weather               23735 non-null  object
 27  X                     23735 non-null  float64
 28  Y                     23735 non-null  float64
 29  Year                  23735 non-null  int64
dtypes: float64(5), int64(2), object(23)
memory usage: 5.4+ MB

In [22]:
# frequency analyis for AOTRoute
route_counts = df['AOTROUTE'].value_counts()
route_counts.head(10)

Unknown    2640
US-7       1811
I-89       1690
I-91       1086
US-2        963
US-5        937
VT-15       768
VT-100      604
VT-9        401
VT-2A       341
Name: AOTROUTE, dtype: int64

In [ ]:
# scale down

In [20]:
#get dummies for animal
animal = pd.get_dummies(df['Animal'])
animal

       Deer  Domestic  Moose  None/Other  Wild
0         0         0      0           1     0
1         0         0      0           1     0
2         0         0      0           1     0
3         0         0      0           1     0
4         0         0      0           1     0
...     ...       ...    ...         ...   ...
23730     0         0      0           1     0
23731     0         0      0           1     0
23732     0         0      0           1     0
23733     0         0      0           1     0
23734     0         0      0           1     0

[23735 rows x 5 columns]

In [16]:
datetime = df['ACCIDENTDATE']
match = re.search(r'\d{4}-\d{2}-\d{2}', datetime[0]).group()
date = datetime.strptime(match.group(), '%Y-%m-%d').date()

2016-12-14